{
  "users": [
    {
      "id": 1,
      "userName": "Menhera",
      "email": "menhera@mail.com",
      "password": "password",
      "urlPhoto": "https://s3.getstickerpack.com/storage/uploads/sticker-pack/menhera-chan-3-1/sticker_28.png?0fce8e4c13ea0763f40b8d577fd192f3",
      "isAuthor": false
    },
    {
      "id": 2,
      "userName": "Bruno Díaz",
      "email": "brunodiaz@mail.com",
      "password": "password",
      "urlPhoto": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRU-iSO5kd5Qk7acXeacucLuhcCTjXiu3SU1fM57yGfKNovY-fhSy4A7NweQmsBVx6oLcU&usqp=CAU",
      "isAuthor": true
    },
    {
      "id": 3,
      "userName": "Takehiko Inoue",
      "email": "tak@mail.com",
      "password": "password",
      "urlPhoto": "https://i0.wp.com/www.coyotemag.fr/wp-content/uploads/2018/04/TAKEHIKO-INOUE-02.jpg",
      "isAuthor": true
    },
    {
      "id": 4,
      "userName": "Bokuto Uno",
      "email": "bokuto@mail.com",
      "password": "password",
      "urlPhoto": "https://cdn.shopify.com/s/files/1/1061/1924/products/Happy_Emoji_Icon_5c9b7b25-b215-4457-922d-fef519a08b06_grande.png?v=1571606090",
      "isAuthor": true
    }
  ],
  "books": [
    {
      "id": 1,
      "authorId": 2,
      "title": "Batman: Year One",
      "synopsis": "The story recounts the beginning of Bruce Wayne's career as Batman and James Gordon's with the Gotham City Police Department.",
      "publishedAt": "1987-02-01",
      "thumbnailUrl": "https://m.media-amazon.com/images/I/71OEX4Y3zJL._AC_UF1000,1000_QL80_.jpg"
    },
    {
      "id": 2,
      "authorId": 3,
      "title": "Vagabond",
      "synopsis": "In 16th-century Japan, Shinmen Takezou is a wild, rough young man, in both his appearance and his actions. His aggressive nature has won him the collective reproach and fear of his village, leading him and his best friend, Matahachi Honiden, to run away in search of something grander than provincial life. The pair enlist in the Toyotomi army, yearning for glory—but when the Toyotomi suffer a crushing defeat at the hands of the Tokugawa Clan at the Battle of Sekigahara, the friends barely make it out alive.",
      "publishedAt": "1998-09-03",
      "thumbnailUrl": "https://cdn.myanimelist.net/images/manga/1/259070l.jpg"
    },
    {
      "id": 3,
      "authorId": 3,
      "title": "Real",
      "synopsis": "Tomomi Nomiya, former captain of his high school's basketball team turned delinquent, decides to drop out of school after he is crushed by the guilt of ruining a young girl's life in a traffic accident. As he dedicates his free time to helping her, he stumbles upon Kiyoharu Togawa, a former sprinter who has lost the use of his right leg and now plays wheelchair basketball as an alternate outlet.",
      "publishedAt": "1999-10-28",
      "thumbnailUrl": "https://cdn.myanimelist.net/images/manga/2/115969l.jpg"
    },
    {
      "id": 4,
      "authorId": 4,
      "title": "Reign of the Seven Spellblades",
      "synopsis": "In the world of magic, there exist deadly irreversible techniques commonly known as spellblades. These sparse and elusive spells, along with their casters, are shrouded in mystery and only their absolute lethality is known to the masses.",
      "publishedAt": "2018-09-07",
      "thumbnailUrl": "https://cdn.myanimelist.net/images/manga/3/231022l.jpg"
    }
  ],
  "book-genres": [
    {
      "id": 1,
      "bookId": 1,
      "genreId": 3
    },
    {
      "id": 2,
      "bookId": 2,
      "genreId": 1
    },
    {
      "id": 3,
      "bookId": 3,
      "genreId": 1
    },
    {
      "id": 4,
      "bookId": 4,
      "genreId": 3
    }
  ],
  "genres": [
    {
      "id": 1,
      "name": "Accion"
    },
    {
      "id": 2,
      "name": "Romance"
    },
    {
      "id": 3,
      "name": "CienciaFiccion"
    },
    {
      "id": 4,
      "name": "Comedia"
    },
    {
      "id": 5,
      "name": "Terror"
    }
  ],
  "chapters": [
    {
      "id": 1,
      "bookId": 1,
      "order": 1,
      "title": "Who I Am - How I Come to Be",
      "content": "Something really cool happens here B)."
    },
    {
      "id": 2,
      "bookId": 1,
      "order": 2,
      "title": "War is Declared",
      "content": "Something really cool happens here B)."
    },
    {
      "id": 3,
      "bookId": 1,
      "order": 3,
      "title": "Black Dawn",
      "content": "Something really cool happens here B)."
    },
    {
      "id": 4,
      "bookId": 1,
      "order": 4,
      "title": "Friend in Need",
      "content": "Something really cool happens here B)."
    },
    {
      "id": 5,
      "bookId": 2,
      "order": 1,
      "title": "Shinmen Takezo",
      "content": "Something really cool happens here B)."
    },
    {
      "id": 6,
      "bookId": 2,
      "order": 2,
      "title": "Akemi",
      "content": "Something really cool happens here B)."
    },
    {
      "id": 7,
      "bookId": 2,
      "order": 3,
      "title": "Oko",
      "content": "Something really cool happens here B)."
    },
    {
      "id": 8,
      "bookId": 4,
      "order": 1,
      "title": "Prologue",
      "content": "Long ago, someone once said, \"The brighter the stars, the darker the night.\"\nIt had been some time since she'd last seen a new moon, which had caused her to remember that quote. Of course, she wasn't so conceited as to consider herself a \"star\" in any sense of the word. Those who knew her, however, would certainly consider her one. She came perfectly prepared for every hunt, regardless of whether her target was human or beast. Even if she were to hunt a star, her preparations would put all hunts before it to shame.\nAnd it was with that same level of preparation that her pursuers hounded her tonight. They seemed wholly convinced of their victory, leading her to sincerely think, I see—these people could certainly snuff out a star.\n“Kh…!”\nAs she raced through the trees, bloodlust nipping at her heels, giant claws\nappeared from the darkness, cleaving all in their path. She instantly spun\naround and drew her athame to block, but she was unable to redirect the\nforce, instead finding herself knocked into the air. As her feet left the ground,\ncreating an opening, another set of claws slashed at her in a follow-up strike.\n“Haaaah!”With a firm step in midair, she countered with the blades in both her\nhands, striking down the giant claw before it could tear into its prey. The\ninstant the attacks abated, she landed on the ground and moved onto the\noffensive herself.\n“—?!”\nBlack mist rushed forward, interrupting her. A chill overcame her, and she\njumped back before her eyes even registered anything. She was a hair too\nslow, however, and the mist brushed her left shoulder. An unpleasant shiver\nran through her whole body, making her every hair stand on end. But she had\nno time to think about that at the moment.\f“Fortis flamma maxime!”\nCrimson fell from the sky like large waves born from a sea of fire,\ninstantly turning the surrounding trees to ash from the intense heat and\nrushing straight for her. The girl readied the athames in both hands and spun\nthe two blades, whirling the flames around and around, scattering them and\ndiverting a portion of the heat wave. The ground became a bubbling cauldron\nof lava under the fire. Only the ground directly beneath her was untouched,\nleaving her standing on a small island.\n“I’m impressed you survived. But we both know struggling is useless.”\nIt was a man’s voice, filled with mockery. The girl looked up at the dark\nsky, which was now intensely illuminated by a pale light—an enormous\nmoon on what should have been a moonless night. Of course, this was no\ncelestial body. It was a ball of light created by magic, a basic spell even a\nchild could cast with enough study. She couldn’t stop herself from shivering.\nAnyone who could turn a simple illumination spell into a temporary moon\nmust have access to a massive well of power.\nSix shadows appeared in the sky, illuminated by the fake moon. One\nstood atop an especially tall tree, while another sat on a broom. One was even\nresting on the shoulder of a mysterious giant. The star hunters all looked\ndown on her from their perches.\n“…!”\f“Fortis flamma maxime!”\nCrimson fell from the sky like large waves born from a sea of fire,\ninstantly turning the surrounding trees to ash from the intense heat and\nrushing straight for her. The girl readied the athames in both hands and spun\nthe two blades, whirling the flames around and around, scattering them and\ndiverting a portion of the heat wave. The ground became a bubbling cauldron\nof lava under the fire. Only the ground directly beneath her was untouched,\nleaving her standing on a small island.\n“I’m impressed you survived. But we both know struggling is useless.”\nIt was a man’s voice, filled with mockery. The girl looked up at the dark\nsky, which was now intensely illuminated by a pale light—an enormous\nmoon on what should have been a moonless night. Of course, this was no\ncelestial body. It was a ball of light created by magic, a basic spell even a\nchild could cast with enough study. She couldn’t stop herself from shivering.\nAnyone who could turn a simple illumination spell into a temporary moon\nmust have access to a massive well of power.\nSix shadows appeared in the sky, illuminated by the fake moon. One\nstood atop an especially tall tree, while another sat on a broom. One was even\nresting on the shoulder of a mysterious giant. The star hunters all looked\ndown on her from their perches.\n“…!”Suddenly, her left shoulder began itching uncontrollably where the black\nmist had touched her, and she didn’t even have time to react before the sound\nof cackling laughter rose from within her clothes. Biting through the cloth, a\nhideously twisted human face about the size of a child’s fist appeared.\nWithout hesitation, she cut away the tumor that had appeared on her body,\nalong with a section of her shoulder. The mass of flesh dropped to the ground\nwith a wet plop. One of the shadows watching lamented:\n“Ahhh, how cruel you are to cut me off! I’m lonely, so lonely! Let me be\none with you!”"
    }
  ]
}